app/controllers/friendships_controller.rb

  def create
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    if @friendship.save
---
INSERT INTO `friendships` (`updated_at`, `user_id`, `friend_id`, `created_at`) VALUES('2009-07-28 20:42:25', 1, 1, '2009-07-28 20:42:25')

  def destroy
    @friendship = current_user.friendships.find(params[:id])
    @friendship.destroy
---
SELECT * FROM `friendships` WHERE (`friendships`.`id` = 1 AND (`friendships`.user_id = 1))
DELETE FROM `friendships` WHERE `id` = 1