app/controllers/posts_controller.rb

  def index
    @posts = Post.all(:order => "created_at DESC")
---
SELECT * FROM `posts` ORDER BY created_at DESC

  def create
    @post = Post.create(:message => params[:message])
---
INSERT INTO `posts` (`created_at`, `updated_at`, `message`) VALUES('2009-07-14 20:17:49', '2009-07-14 20:17:49', 'Message 1')